{
  "es": {
    "titles": {
      "t1": "Hola soy",
      "t2": "y soy desarrollador."
    },
    "navbar": {
      "home": "Inicio",
      "profile": "Perfil",
      "portfolio": "Proyectos",
      "contact": "Contacto",
      "language": {
        "title": "Idioma",
        "es": "Español",
        "en": "Ingles"
      }
    },
    "profile": {
      "title": "Perfil",
      "caption": {
        "c1": "Rápido",
        "c2": "Intuitivo",
        "c3": "Responsivo",
        "c4": "Dinámico"
      },
      "text": {
        "txt1": "Los tiempos de carga rápidos e interacción sin demoras son mi máxima prioridad al crear sitios web.",
        "txt2": "Tengo una fuerte preferencia por una UI intuitiva y fácil de usar.",
        "txt3": "Mis proyectos están orientados a todo tipo de dispositivos (grande o pequeño).",
        "txt4": "Los sitios web no tienen por qué ser estáticos, me encanta que las páginas cobren vida."
      },
      "who": {
        "question": "¿Quién es este chico?",
        "text": "Soy Fabian tengo 25 años, soy Ingeniero en Informática. Vivo en Santiago de Chile (Maipú), ¿Mis Hobbies? La magia, la música, el baloncesto, el café y la creación de páginas web.",
        "dowload": "Descargar CV"
      },
      "skills": "Mis habilidades técnicas"
    },
    "projects": {
      "titles": {
        "t1": "Pagina web 'Casita Latina'",
        "t2": "Bot de Discord",
        "t3": "otro Proyecto",
        "t4": "otro Proyecto"
      },
      "description": {
        "d1": "Este proyecto consistió en una pagina web informativa responsiva para una micro empresa de idioma, Christian el cliente, es un Argentino que se fue a vivir a Polonia, hoy en día trabaja enseñando español en este país, el necesitaba un sitio web donde pudiera promocionar sus servicios y dar a conocer su información de contacto su sitio web 'Casita Latina' este sitio se encuentra completamente en Polaco. este sitio se realizo con HTML, CSS (Boostrap), y JavaScript.",
        "d2": "Discord es una aplicación que permite comunicarse a través de mensajes de texto, voz y video diseñada principalmente para comunidades de videojuegos. Se programó un Bot para leer mensajes de texto y reaccionar a ellos mediante ciertos comandos. Estos comandos utilizaban un apóstrofe o palabra clave para interpretarlos como comandos. La aplicación se realizó en Replit, una plataforma de programación que permite ejecutar código en diferentes lenguajes. Se mantuvo en línea mediante un pinger o herramienta de ping que verificaba si el sitio estaba en línea cada 5 minutos. Se utilizó Node js como entorno de ejecución, algunas de las acciones que realizaba este bot era, la asignación de roles a los usuarios, dar hora Utc y dar la cantidad de usuarios conectados o usuarios dentro de la comunidad.",
        "d3": "Descripción",
        "d4": "Descripción"
      }
    },
    "certification": {
      "title": "Certificados y Reconocimientos",
      "titles": {
        "t1": "Certificado Global Classroom"
      },
      "dowloadCertification": "Descargar Certificado",
      "dowloadRecognition": "Descargar Reconocimiento"
    },
    "footer": {
      "contact": {
        "title": "Contacto",
        "phone": "Teléfono",
        "email": "Correo electrónico"
      },
      "social": {
        "title": "Redes Sociales",
        "git": "Sigue mis proyectos en GitHub.",
        "lk": "Puedes conectar conmigo por LinkedIn.",
        "ig": "Conoce más de mi vida y hobbies."
      }
    }
  },
  "en": {
    "titles": {
      "t1": "Hi I´m",
      "t2": "And I´m Developer."
    },
    "navbar": {
      "home": "Home",
      "profile": "Profile",
      "portfolio": "Projects",
      "contact": "Contact",
      "language": {
        "title": "Language",
        "es": "Spanish",
        "en": "English"
      }
    },
    "profile": {
      "title": "Profile",
      "caption": {
        "c1": "Faster",
        "c2": "Intuitive",
        "c3": "Responsive",
        "c4": "Dynamic"
      },
      "text": {
        "txt1": "Fast loading times and seamless interaction are my top priority when creating websites.",
        "txt2": "I have a strong preference for intuitive and user-friendly UI.",
        "txt3": "My projects are oriented towards all types of devices (large or small).",
        "txt4": "Websites don't have to be static, I love it when pages come to life."
      },
      "who": {
        "question": "¿Who is this guy?",
        "text": "I am Fabian, I am 25 years old and I am a Computer Engineer. I live in Santiago de Chile (Maipú). My hobbies include magic, music, basketball, coffee, and creating websites.",
        "dowload": "Dowload CV"
      },
      "skills": "Skills"
    },
    "projects": {
      "titles": {
        "t1": "Web Page 'Casita Latina'",
        "t2": "Bot Discord",
        "t3": "other Project",
        "t4": "other Project"
      },
      "description": {
        "d1": "This project consisted of a responsive informative website for a small language business, Christian the client, is an Argentine who moved to Poland and currently works teaching Spanish in this country, he needed a website where he could promote his services and share his contact information his website 'Casita Latina' this site is completely in Polish. this site was made with HTML, CSS (Boostrap), and JavaScript.",
        "d2": "Discord is an application that allows communication through text, voice, and video messages, mainly designed for video game communities. A Bot was programmed to read text messages and react to them through certain commands. These commands used an apostrophe or keyword to interpret them as commands. The application was carried out in Replit, a programming platform that allows code to be executed in different languages. It was kept online through a pinger or ping tool that verified if the site was online every 5 minutes. Node js was used as the execution environment, some of the actions that this bot performed were, the assignment of roles to users, giving the Utc time and giving the number of connected users or users within the community.",
        "d3": "Description.",
        "d4": "Description."
      }
    },
    "certification": {
      "title": "Certificates and Recognitions",
      "titles": {
        "t1": "Certificate Global Classroom"
      },
      "dowloadCertification": "Dowload Certificate",
      "dowloadRecognition": "Dowload Recognitions"
    },
    "footer": {
      "contact": {
        "title": "Contact",
        "phone": "Phone",
        "email": "Email"
      },
      "social": {
        "title": "Social media",
        "git": "Follow my projects on GitHub.",
        "lk": "You can connect with me on LinkedIn.",
        "ig": "Learn more about my life and hobbies."
      }
    }
  }
}