{
  "es": {
    "general": {
      "titleDetail": "Descripción de Proyecto.",
      "titleTec": "Tecnologías Utilizadas.",
      "titleLink": "Link demostrativo o en actual funcionamiento.",
      "back":"Volver",
      "languaje":"Idioma",
      "spanish":"Español",
      "english":"Ingles",
      "next":"Siguiente Proyecto -->",
      "prev":"<-- Proyecto Anterior",
      "footer": {
        "contact": {
          "title": "Contacto",
          "phone": "Teléfono",
          "email": "Correo electrónico"
        },
        "social": {
          "title": "Redes Sociales",
          "git": "Sigue mis proyectos en GitHub.",
          "lk": "Puedes conectar conmigo por LinkedIn.",
          "ig": "Conoce más de mi vida y hobbies."
        }
      }
    },
    "project1": {
      "title": "Casita Latina",
      "detail": "La página web 'Casita Latina' fue creada en 2021. Hecha para Christian, un argentino que actualmente vive y trabaja en Polonia, es una herramienta que le permite publicitar su trabajo como profesor de español en el país. Christian decidió mudarse a Polonia hace algunos años y ha encontrado en la enseñanza del idioma español una forma de aportar a su comunidad y compartir su cultura.",
      "detail2":"A través de esta página web, Christian ofrece información sobre sus clases de español, que son dirigidas tanto a personas que desean aprender el idioma por primera vez como a aquellas que ya tienen conocimientos básicos y desean mejorar su fluidez y comprensión. La página también incluye una sección con comentarios de algunos de sus alumnos, para motivar a cualquier persona interesada en aprender español.",
      "detail3":"Además de brindar información sobre sus clases y recursos para aprender español, la página web de Christian también ofrece una breve descripción sobre él y su experiencia como profesor, así como su información de contacto para aquellos interesados en contratar sus servicios o obtener más información.",
      "detail4":"En resumen, la página web creada para Christian es una plataforma útil y accesible para aquellos que desean aprender español en Polonia y para aquellos que quieren saber más sobre el trabajo de Christian como profesor de español.",
      "tec1": "Lenguaje utilizado para generar decoración de sitio web.",
      "tec2": "Lenguaje utilizado para generar estructura de sitio web.",
      "tec3": "Tecnologia utilizada para hacer responsivo el sitio web.",
      "link":"Link oficial para acceder al sitio web: "
    },
    "project2": {
      "title": "Bot Discord",
      "detail": "Discord es una aplicación de comunicación en línea gratuita diseñada especialmente para los gamers. Permite a los usuarios comunicarse entre sí a través de mensajes de texto, voz y video en tiempo real. Discord también incluye una variedad de herramientas de moderación y personalización para que los usuarios puedan crear sus propios servidores y canales de chat. Además, Discord cuenta con una amplia gama de integraciones con otras aplicaciones y servicios, como Spotify, Twitch y YouTube, lo que facilita aún más la comunicación entre los usuarios. Dentro de esas herramientas cuenta con una llamada Bot.",
      "detail2":"Un 'Bot' en Discord es un programa automatizado que puede interactuar con los usuarios de un servidor de Discord a través de comandos y acciones predefinidas.",
      "detail3":"El Bot de Discord es un proyecto que tiene como objetivo facilitar la gestión de comunidades en Discord. Este Bot cuenta con diversas funcionalidades que permiten automatizar algunos procesos y agregar ciertas características únicas a una comunidad específica. Algunas de las tareas que este Bot puede realizar son:",
      "detail4":"1) Asignación de roles a los usuarios: El Bot puede asignar roles a los usuarios de manera automática o mediante comandos especiales. Esto permite personalizar la experiencia de usuario y otorgar ciertos permisos a ciertos grupos de usuarios.",
      "detail5":"2) Indicación de la hora en UTC: El Bot puede mostrar la hora en el formato Coordinated Universal Time (UTC) a través de un comando especial. Esto puede ser útil para coordinar actividades en línea a nivel internacional.",
      "detail6":"3) Conteo de usuarios conectados o presentes: El Bot puede mostrar cuántos usuarios están conectados o presentes en un momento determinado a través de un comando especial. Esto puede ser útil para saber cuánta gente hay disponible para jugar o participar en actividades.",
      "tec1":"Lenguaje de programación principal utilizado para crear el bot.",
      "tec2":"entorno de ejecución de JavaScript que se utiliza para ejecutar el bot. Node.js proporciona una serie de funcionalidades que te permiten interactuar con el sistema operativo y con otras partes del ordenador",
      "tec3":"Biblioteca de JavaScript que te permite interactuar con la API de Discord. La API de Discord te permite enviar y recibir mensajes a través del servicio de Discord y realizar otras acciones como unirse y salir de servidores.",
      "tec4":"Plataforma en línea que te permite escribir, compilar y ejecutar el código del bot. Replit proporciona un entorno de desarrollo en el navegador y también puede alojar el bot una vez que esté completamente desarrollado.",
      "tec5":"Sistema de control de versiones que te permite guardar copias del código del bot y rastrear cambios a lo largo del tiempo. Git te permite colaborar con otros programadores y mantener un registro de cómo evolucionó el código del bot.",
      "link":"Link donde podrás entrar a mi servidor para hacer pruebas con el bot:",
      "link2":"Link para invitar el bot a tu servidor:",
      "link3":"Es aconsejable utilizar el comando !help una vez que hayas accedido al servidor para ver todas las acciones que puede realizar el bot."
    }
  },
  "en": {
    "general": {
      "titleDetail": "Project Description.",
      "titleTec": "Used Technologies.",
      "titleLink": "Demonstration link or currently in operation.",
      "back":"Back",
      "languaje":"Languaje",
      "spanish":"Spanish",
      "english":"English",
      "next":"Next Project -->",
      "prev":"<-- Previus Project ",
      "footer": {
        "contact": {
          "title": "Contact",
          "phone": "Phone",
          "email": "Email"
        },
        "social": {
          "title": "Social media",
          "git": "Follow my projects on GitHub.",
          "lk": "You can connect with me on LinkedIn.",
          "ig": "Learn more about my life and hobbies."
        }
      }
    },
    "project1": {
      "title": "Casita Latina",
      "detail": "The 'Casita Latina' webpage was created in 2021. Made for Christian, an Argentine who currently lives and works in Poland, it is a tool that allows him to advertise his work as a Spanish teacher in the country. Christian decided to move to Poland a few years ago and has found teaching the Spanish language a way to contribute to his community and share his culture.",
      "detail2": "Through this webpage, Christian offers information about his Spanish classes, which are aimed at both people who want to learn the language for the first time and those who already have basic knowledge and want to improve their fluency and comprehension. The page also includes a section with comments from some of his students, to motivate anyone interested in learning Spanish.",
      "detail3": "In addition to providing information about his classes and resources for learning Spanish, Christian's webpage also offers a brief description of him and his experience as a teacher, as well as his contact information for those interested in hiring his services or obtaining more information.",
      "detail4": "In summary, the webpage created for Christian is a useful and accessible platform for those who want to learn Spanish in Poland and for those who want to know more about Christian's work as a Spanish teacher.",
      "tec1": "Language used to generate website decoration.",
      "tec2": "Language used to generate website structure.",
      "tec3": "Technology used to make the website responsive.",
      "link": "Official link to access the website:"
    },
    "project2": {
      "title": "Bot Discord",
      "detail": "Discord is a free online communication application designed specifically for gamers. It allows users to communicate with each other through real-time text, voice, and video messaging. Discord also includes a variety of moderation and customization tools for users to create their own servers and chat channels. In addition, Discord has a wide range of integrations with other applications and services, such as Spotify, Twitch, and YouTube, which further facilitates communication among users. Within these tools, it has a feature called Bot.",
      "detail2": "A 'Bot' in Discord is an automated program that can interact with users on a Discord server through predetermined commands and actions.",
      "detail3": "The Discord Bot is a project that aims to facilitate the management of communities on Discord. This Bot has various functionalities that allow automating some processes and adding certain unique features to a specific community. Some of the tasks that this Bot can perform are:",
      "detail4": "1) User role assignment: The Bot can automatically assign roles to users or through special commands. This allows customizing the user experience and granting certain permissions to certain groups of users.",
      "detail5": "2) UTC time indication: The Bot can show the time in Coordinated Universal Time (UTC) format through a special command. This can be useful for coordinating online activities internationally.",
      "detail6": "3) Counting of connected or present users: The Bot can show how many users are connected or present at a given time through a special command. This can be useful to know how many people are available to play or participate in activities.",
      "tec1":"Main programming language used to create the bot.",
      "tec2":"JavaScript runtime environment that is used to run the bot. Node.js provides a number of features that allow you to interact with the operating system and other parts of the computer",
      "tec3":"JavaScript library that allows you to interact with the Discord API. The Discord API allows you to send and receive messages through the Discord service and perform other actions such as joining and leaving servers.",
      "tec4":"Online platform that allows you to write, compile and run the bot's code. Replit provides a development environment in the browser and can also host the bot once it is fully developed.",
      "tec5":"Version control system that allows you to save copies of the bot's code and track changes over time. Git allows you to collaborate with other programmers and keep a record of how the bot's code evolved.",
      "link":"Link where you can enter my server to test the bot:",
      "link2":"Link to invite the bot to your server:",
      "link3":"It is advisable to use the command !help once you have accessed the server to see all the actions that the bot can perform."
      
    }
  }
}
